cases/ansys_verification/VMFL046-R6/case/system/controlDict.template
FoamFile { version 2.0; format ascii; class dictionary; object controlDict; }
// VMFL046-R6 -- DENSITY-BASED, TRANSIENT.  Greenshields, Weller, Gasparini & Reese (2010),
// Int. J. Numer. Meth. Fluids 63:1-21, DOI 10.1002/fld.2069 -- the KNP central-upwind
// scheme OpenFOAM provides as rhoCentralFoam for high-speed flow with shocks.
//
// R6 CHANGES vs R5 (both FORCED by the successor axis, not preferences):
//   (1) application rhoPimpleFoam -> rhoCentralFoam.  R4 hunted and R5 washed out under the
//       pressure-based segregated solver; R6 moves to the density-based shock-capturing path.
//   (2) maxCo 0.5 -> 0.2.  rhoCentralFoam's CourantNo is ACOUSTIC (|U|+c based) and the time
//       stepping is EXPLICIT, so it needs a tighter Courant limit than implicit PIMPLE.
//   (3) the outlet relaxation length in 0/p (lInf 2.0 -> 0.3) -- the R5 wash-out repair.
// endTime, the mesh, the sampler, DELTA_X, maxDeltaT and the gate are carried from R5 UNCHANGED.
application     rhoCentralFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         __ENDTIME__;
deltaT          1e-8;          // seed only; adjustTimeStep takes over at step 1
writeControl    adjustableRunTime;
writeInterval   __ENDTIME__;   // fields (U,T,p,rho,e) at endTime only -> plant + gate + age guard
purgeWrite      0;
writeFormat     ascii;
writePrecision  12;
writeCompression off;
timeFormat      general;
timePrecision   10;
runTimeModifiable false;

// THE STABILITY CONSTANTS.  maxCo 0.2 is the pre-committed R6 value (PREREGISTRATION §6);
// it is TIGHTER than the rhoCentralFoam tutorial default 0.5 because a standing normal shock
// wants robust explicit stepping.  maxDeltaT 1.0e-4 is carried from R5 byte-for-value; it is
// NON-BINDING (the acoustic-Courant step is ~1e-6 s, far below it) and is retained so the
// frozen comparator's maxDeltaT check is unchanged.
adjustTimeStep  yes;
maxCo           0.2;
maxDeltaT       1.0e-4;

functions
{
    // The R2 refining-sampler rule is CARRIED FORWARD UNCHANGED: nPoints = 2*(NXA+NXB)+1,
    // i.e. exactly 2 samples per axial cell at every level (sampler/mesh = 0.499000 at
    // L1, L2 and L3 alike).  R1's flat `nPoints 400` under-resolved by 1.6008x at L3.
    //     L1 nPoints 321   L2 nPoints 641   L3 nPoints 1281
    //
    // WHAT CHANGED, AND IT IS ONLY THE CLOCK: writeControl timeStep/writeInterval 500
    // (iterations) becomes adjustableRunTime/writeInterval __SAMPLEDT__ (seconds).  The
    // GRADED value is 5.0e-04 s against endTime 0.080 s -> 160 samples, and the plateau
    // window W = endTime/10 = 8.0e-03 s therefore holds 16 samples against R2's 13.  A ptp
    // over MORE samples can only be LARGER, so the plateau limb is STRICTLY STRICTER than
    // R2's at the same unchanged DELTA_X.  Nothing is loosened.
    //
    // adjustableRunTime makes the solver shorten dt to land exactly on each write time;
    // §12 records the directory names this produced on disk (0.0001, 0.0002, ...), which
    // is the §39.5 evidence that the comparator's history regex matches what is written.
    // A CLAUSE-B smoke may override __SAMPLEDT__ to prove, in a handful of steps, that the
    // sampler WRITES nPoints rows; the comparator refuses any level whose controlDict does
    // not carry the graded pair.
    centreline
    {
        type            sets;
        libs            ("libsampling.so");
        writeControl    adjustableRunTime;
        writeInterval   __SAMPLEDT__;
        interpolationScheme cellPoint;
        setFormat       raw;
        fields          (U T);
        sets
        (
            line
            {
                type    uniform;
                axis    x;
                start   (0.002 0.0 0.0);
                end     (1.998 0.0 0.0);
                nPoints __NPOINTS__;
            }
        );
    }
}
